dave1b/Micro-C/SW05Zeiger/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v9.0
processor: MK22FN512xxx12
package_id: MK22FN512VDC12
mcu_data: ksdk2_0
processor_version: 9.0.0
pin_labels:
- {pin_num: L9, pin_signal: PTA15/SPI0_SCK/UART0_RX/I2S0_RXD0, label: RED_R_R, identifier: RED_R_R}
- {pin_num: H10, pin_signal: ADC1_SE17/PTA17/SPI0_SIN/UART0_RTS_b/I2S0_MCLK, label: RED_R_L, identifier: RED_R_L}
- {pin_num: J10, pin_signal: PTA16/SPI0_SOUT/UART0_CTS_b/I2S0_RX_FS, label: RED_R_R_BREAK, identifier: RED_R_R_BREAK}
- {pin_num: F10, pin_signal: PTB20/FB_AD31/CMP0_OUT, label: RED_R_L_BREAK, identifier: RED_R_L_BREAK}
- {pin_num: A7, pin_signal: ADC1_SE4b/CMP0_IN2/PTC8/FTM3_CH4/I2S0_MCLK/FB_AD7, label: GREEN_F_L, identifier: GREEN_F_L}
- {pin_num: D6, pin_signal: ADC1_SE5b/CMP0_IN3/PTC9/FTM3_CH5/I2S0_RX_BCLK/FB_AD6/FTM2_FLT0, label: RED_F_L, identifier: RED_F_L}
- {pin_num: C6, pin_signal: ADC1_SE6b/PTC10/I2C1_SCL/FTM3_CH6/I2S0_RX_FS/FB_AD5, label: BLUE_F_L, identifier: BLUE_F_L}
- {pin_num: C5, pin_signal: ADC1_SE7b/PTC11/LLWU_P11/I2C1_SDA/FTM3_CH7/FB_RW_b, label: GREEN_F_R, identifier: GREEN_F_R}
- {pin_num: C3, pin_signal: PTD2/LLWU_P13/SPI0_SOUT/UART2_RX/FTM3_CH2/FB_AD4/LPUART0_RX/I2C0_SCL, label: RED_F_R, identifier: RED_F_R}
- {pin_num: B3, pin_signal: PTD3/SPI0_SIN/UART2_TX/FTM3_CH3/FB_AD3/LPUART0_TX/I2C0_SDA, label: BLUE_F_R, identifier: BLUE_F_R}
- {pin_num: K7, pin_signal: PTA5/USB_CLKIN/FTM0_CH2/I2S0_TX_BCLK/JTAG_TRST_b, label: IMU_INT, identifier: IMU_INT}
- {pin_num: H5, pin_signal: ADC0_SE17/PTE24/I2C0_SCL/EWM_OUT_b, label: I2C_SCL, identifier: I2C_SCL}
- {pin_num: J5, pin_signal: ADC0_SE18/PTE25/I2C0_SDA/EWM_IN, label: I2C_SDA, identifier: I2C_SDA}
- {pin_num: B8, pin_signal: CMP1_IN1/PTC3/LLWU_P7/SPI0_PCS1/UART1_RX/FTM0_CH2/CLKOUT/I2S0_TX_BCLK/LPUART0_RX, label: COL_SEN_INT, identifier: COL_SEN_INT}
- {pin_num: B6, pin_signal: PTC12/FB_AD27/FTM3_FLT0, label: COL_SEN_LED_W, identifier: COL_SEN_LED_W}
- {pin_num: H6, pin_signal: PTE26/CLKOUT32K/RTC_CLKOUT/USB_CLKIN, label: NRES_DISP, identifier: NRES_DISP}
- {pin_num: G11, pin_signal: ADC0_SE8/ADC1_SE8/PTB0/LLWU_P5/I2C0_SCL/FTM1_CH0/FTM1_QD_PHA, label: RIGHT, identifier: RIGHT}
- {pin_num: G10, pin_signal: ADC0_SE9/ADC1_SE9/PTB1/I2C0_SDA/FTM1_CH1/FTM1_QD_PHB, label: DOWN, identifier: DOWN}
- {pin_num: G9, pin_signal: ADC0_SE12/PTB2/I2C0_SCL/UART0_RTS_b/FTM0_FLT3, label: UP, identifier: UP}
- {pin_num: E10, pin_signal: PTB9/SPI1_PCS1/LPUART0_CTS_b/FB_AD20, label: PUSH, identifier: PUSH;LEFT}
- {pin_num: G8, pin_signal: ADC0_SE13/PTB3/I2C0_SDA/UART0_CTS_b/FTM0_FLT0, label: PUSH, identifier: PUSH}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
    LED();
    JOYSTICK();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: H5, peripheral: I2C0, signal: SCL, pin_signal: ADC0_SE17/PTE24/I2C0_SCL/EWM_OUT_b}
  - {pin_num: J5, peripheral: I2C0, signal: SDA, pin_signal: ADC0_SE18/PTE25/I2C0_SDA/EWM_IN}
  - {pin_num: K7, peripheral: GPIOA, signal: 'GPIO, 5', pin_signal: PTA5/USB_CLKIN/FTM0_CH2/I2S0_TX_BCLK/JTAG_TRST_b, direction: INPUT}
  - {pin_num: B8, peripheral: GPIOC, signal: 'GPIO, 3', pin_signal: CMP1_IN1/PTC3/LLWU_P7/SPI0_PCS1/UART1_RX/FTM0_CH2/CLKOUT/I2S0_TX_BCLK/LPUART0_RX, direction: INPUT}
  - {pin_num: B6, peripheral: GPIOC, signal: 'GPIO, 12', pin_signal: PTC12/FB_AD27/FTM3_FLT0, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: H6, peripheral: GPIOE, signal: 'GPIO, 26', pin_signal: PTE26/CLKOUT32K/RTC_CLKOUT/USB_CLKIN, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    gpio_pin_config_t IMU_INT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA5 (pin K7)  */
    GPIO_PinInit(BOARD_INITPINS_IMU_INT_GPIO, BOARD_INITPINS_IMU_INT_PIN, &IMU_INT_config);

    gpio_pin_config_t COL_SEN_INT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC3 (pin B8)  */
    GPIO_PinInit(BOARD_INITPINS_COL_SEN_INT_GPIO, BOARD_INITPINS_COL_SEN_INT_PIN, &COL_SEN_INT_config);

    gpio_pin_config_t COL_SEN_LED_W_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTC12 (pin B6)  */
    GPIO_PinInit(BOARD_INITPINS_COL_SEN_LED_W_GPIO, BOARD_INITPINS_COL_SEN_LED_W_PIN, &COL_SEN_LED_W_config);

    gpio_pin_config_t NRES_DISP_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE26 (pin H6)  */
    GPIO_PinInit(BOARD_INITPINS_NRES_DISP_GPIO, BOARD_INITPINS_NRES_DISP_PIN, &NRES_DISP_config);

    /* PORTA5 (pin K7) is configured as PTA5 */
    PORT_SetPinMux(BOARD_INITPINS_IMU_INT_PORT, BOARD_INITPINS_IMU_INT_PIN, kPORT_MuxAsGpio);

