dave1b/Micro-C/SW05Zeiger/board/pin_mux.c
    /* PORTC12 (pin B6) is configured as PTC12 */
    PORT_SetPinMux(BOARD_INITPINS_COL_SEN_LED_W_PORT, BOARD_INITPINS_COL_SEN_LED_W_PIN, kPORT_MuxAsGpio);

    /* PORTC3 (pin B8) is configured as PTC3 */
    PORT_SetPinMux(BOARD_INITPINS_COL_SEN_INT_PORT, BOARD_INITPINS_COL_SEN_INT_PIN, kPORT_MuxAsGpio);

    /* PORTE24 (pin H5) is configured as I2C0_SCL */
    PORT_SetPinMux(BOARD_INITPINS_I2C_SCL_PORT, BOARD_INITPINS_I2C_SCL_PIN, kPORT_MuxAlt5);

    /* PORTE25 (pin J5) is configured as I2C0_SDA */
    PORT_SetPinMux(BOARD_INITPINS_I2C_SDA_PORT, BOARD_INITPINS_I2C_SDA_PIN, kPORT_MuxAlt5);

    /* PORTE26 (pin H6) is configured as PTE26 */
    PORT_SetPinMux(BOARD_INITPINS_NRES_DISP_PORT, BOARD_INITPINS_NRES_DISP_PIN, kPORT_MuxAsGpio);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
LED:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: D6, peripheral: GPIOC, signal: 'GPIO, 9', pin_signal: ADC1_SE5b/CMP0_IN3/PTC9/FTM3_CH5/I2S0_RX_BCLK/FB_AD6/FTM2_FLT0, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: A7, peripheral: GPIOC, signal: 'GPIO, 8', pin_signal: ADC1_SE4b/CMP0_IN2/PTC8/FTM3_CH4/I2S0_MCLK/FB_AD7, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: C6, peripheral: GPIOC, signal: 'GPIO, 10', pin_signal: ADC1_SE6b/PTC10/I2C1_SCL/FTM3_CH6/I2S0_RX_FS/FB_AD5, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: C3, peripheral: GPIOD, signal: 'GPIO, 2', pin_signal: PTD2/LLWU_P13/SPI0_SOUT/UART2_RX/FTM3_CH2/FB_AD4/LPUART0_RX/I2C0_SCL, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: C5, peripheral: GPIOC, signal: 'GPIO, 11', pin_signal: ADC1_SE7b/PTC11/LLWU_P11/I2C1_SDA/FTM3_CH7/FB_RW_b, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: B3, peripheral: GPIOD, signal: 'GPIO, 3', pin_signal: PTD3/SPI0_SIN/UART2_TX/FTM3_CH3/FB_AD3/LPUART0_TX/I2C0_SDA, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: H10, peripheral: GPIOA, signal: 'GPIO, 17', pin_signal: ADC1_SE17/PTA17/SPI0_SIN/UART0_RTS_b/I2S0_MCLK, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: L9, peripheral: GPIOA, signal: 'GPIO, 15', pin_signal: PTA15/SPI0_SCK/UART0_RX/I2S0_RXD0, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: F10, peripheral: GPIOB, signal: 'GPIO, 20', pin_signal: PTB20/FB_AD31/CMP0_OUT, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: J10, peripheral: GPIOA, signal: 'GPIO, 16', pin_signal: PTA16/SPI0_SOUT/UART0_CTS_b/I2S0_RX_FS, direction: OUTPUT, gpio_init_state: 'true'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : LED
 * Description   : All MC Car LEDs
 *
 * END ****************************************************************************************************************/
void LED(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);

    gpio_pin_config_t RED_R_R_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTA15 (pin L9)  */
    GPIO_PinInit(LED_RED_R_R_GPIO, LED_RED_R_R_PIN, &RED_R_R_config);

    gpio_pin_config_t RED_R_R_BREAK_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTA16 (pin J10)  */
    GPIO_PinInit(LED_RED_R_R_BREAK_GPIO, LED_RED_R_R_BREAK_PIN, &RED_R_R_BREAK_config);

    gpio_pin_config_t RED_R_L_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTA17 (pin H10)  */
    GPIO_PinInit(LED_RED_R_L_GPIO, LED_RED_R_L_PIN, &RED_R_L_config);

    gpio_pin_config_t RED_R_L_BREAK_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTB20 (pin F10)  */
    GPIO_PinInit(LED_RED_R_L_BREAK_GPIO, LED_RED_R_L_BREAK_PIN, &RED_R_L_BREAK_config);

    gpio_pin_config_t GREEN_F_L_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTC8 (pin A7)  */
    GPIO_PinInit(LED_GREEN_F_L_GPIO, LED_GREEN_F_L_PIN, &GREEN_F_L_config);

    gpio_pin_config_t RED_F_L_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTC9 (pin D6)  */
    GPIO_PinInit(LED_RED_F_L_GPIO, LED_RED_F_L_PIN, &RED_F_L_config);

    gpio_pin_config_t BLUE_F_L_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTC10 (pin C6)  */
    GPIO_PinInit(LED_BLUE_F_L_GPIO, LED_BLUE_F_L_PIN, &BLUE_F_L_config);

    gpio_pin_config_t GREEN_F_R_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTC11 (pin C5)  */
    GPIO_PinInit(LED_GREEN_F_R_GPIO, LED_GREEN_F_R_PIN, &GREEN_F_R_config);

    gpio_pin_config_t RED_F_R_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTD2 (pin C3)  */
    GPIO_PinInit(LED_RED_F_R_GPIO, LED_RED_F_R_PIN, &RED_F_R_config);

    gpio_pin_config_t BLUE_F_R_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTD3 (pin B3)  */
    GPIO_PinInit(LED_BLUE_F_R_GPIO, LED_BLUE_F_R_PIN, &BLUE_F_R_config);

    /* PORTA15 (pin L9) is configured as PTA15 */
    PORT_SetPinMux(LED_RED_R_R_PORT, LED_RED_R_R_PIN, kPORT_MuxAsGpio);

    /* PORTA16 (pin J10) is configured as PTA16 */
    PORT_SetPinMux(LED_RED_R_R_BREAK_PORT, LED_RED_R_R_BREAK_PIN, kPORT_MuxAsGpio);

    /* PORTA17 (pin H10) is configured as PTA17 */
    PORT_SetPinMux(LED_RED_R_L_PORT, LED_RED_R_L_PIN, kPORT_MuxAsGpio);

